C3/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |                                                 
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           
   \\    /   O peration     | Website:  https://openfoam.org                                                
    \\  /    A nd           | Version:  13                                                
     \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

all
{
	type	box;
	zoneType	cell;
	
	//Slightly larger than the domain 
	// x -10m to +4.92m, y -0.1m to +4.965m, z -0.1m to +2.760m
	box	(-11 -1 -1) (5 5 3);
}

domainInside
{
	type        insideSurface;
	zoneType    cell;

	surface     closedTriSurface;
	file        "domainInside.stl";
}

domainOutside
{
	type        insideSurface;
	zoneType    cell;

	surface     closedTriSurface;
	file        "domainOutside.stl";
}

// ************************************************************************* //

